Scripts/Common/XML enviado.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ImportarDatosXML xmlns="http://generictransfer.com/"><idDocumento>62512</idDocumento><strNombreDocumento>VENTA SERVICIO</strNombreDocumento><idCompania>2</idCompania><strCompania>1</strCompania><strUsuario>gt</strUsuario><strClave>gt</strClave><strFuenteDatos><![CDATA[<venta><Inicial>
  <F_CIA>1</F_CIA>
</Inicial><Documentos>
  <F_CIA>1</F_CIA>
  <F350_ID_CO>10</F350_ID_CO>
  <F350_ID_TIPO_DOCTO>FV</F350_ID_TIPO_DOCTO>
  <F350_CONSEC_DOCTO>191375</F350_CONSEC_DOCTO>
  <F350_FECHA>20200826</F350_FECHA>
  <F350_ID_TERCERO>830031687</F350_ID_TERCERO>
  <F350_NOTAS />
  <F311_ID_SUCURSAL_CLI>001</F311_ID_SUCURSAL_CLI>
  <F311_ID_TIPO_CLI>0005</F311_ID_TIPO_CLI>
  <F311_ID_TERCERO_VENDEDOR>830002655</F311_ID_TERCERO_VENDEDOR>
  <F311_ID_COND_PAGO>30D</F311_ID_COND_PAGO>
  <F311_ID_MONEDA_DOCTO>USD</F311_ID_MONEDA_DOCTO>
  <F311_ID_MONEDA_CONV> </F311_ID_MONEDA_CONV>
  <F311_TASA_CONV>00003303.1400</F311_TASA_CONV>
  <F311_TASA_LOCAL>1</F311_TASA_LOCAL>
  <F311_NUMERO_ORDEN_COMPRA>456</F311_NUMERO_ORDEN_COMPRA>
</Documentos>
  <Movimientos>
    <F_CIA>1</F_CIA>
    <F350_ID_CO>10</F350_ID_CO>
    <F350_ID_TIPO_DOCTO>FV</F350_ID_TIPO_DOCTO>
    <F350_CONSEC_DOCTO>191375</F350_CONSEC_DOCTO>
    <F320_ROWID>1</F320_ROWID>
    <F320_ID_MOTIVO>IT</F320_ID_MOTIVO>
    <F320_ID_CO_MOVTO>10</F320_ID_CO_MOVTO>
    <F320_ID_UN_MOVTO>10</F320_ID_UN_MOVTO>
    <F320_ID_CCOSTO_MOVTO>DO202008DD-015</F320_ID_CCOSTO_MOVTO>
    <F320_ID_TERCERO_MOVTO>830031687</F320_ID_TERCERO_MOVTO>
    <F320_ID_SUCURSAL_CLIENTE>001</F320_ID_SUCURSAL_CLIENTE>
    <F320_VLR_BRUTO>1001</F320_VLR_BRUTO>
  </Movimientos>
  <Movimientos>
    <F_CIA>1</F_CIA>
    <F350_ID_CO>10</F350_ID_CO>
    <F350_ID_TIPO_DOCTO>FV</F350_ID_TIPO_DOCTO>
    <F350_CONSEC_DOCTO>191375</F350_CONSEC_DOCTO>
    <F320_ROWID>2</F320_ROWID>
    <F320_ID_SERVICIO>VS0007</F320_ID_SERVICIO>
    <F320_ID_MOTIVO>IT</F320_ID_MOTIVO>
    <F320_ID_CO_MOVTO>10</F320_ID_CO_MOVTO>
    <F320_ID_UN_MOVTO>10</F320_ID_UN_MOVTO>
    <F320_ID_CCOSTO_MOVTO>DO202008DD-015</F320_ID_CCOSTO_MOVTO>
    <F320_ID_TERCERO_MOVTO>830031687</F320_ID_TERCERO_MOVTO>
    <F320_ID_SUCURSAL_CLIENTE>001</F320_ID_SUCURSAL_CLIENTE>
    <F320_VLR_BRUTO>1002</F320_VLR_BRUTO>
  </Movimientos>
  <Movimientos>
    <F_CIA>1</F_CIA>
    <F350_ID_CO>10</F350_ID_CO>
    <F350_ID_TIPO_DOCTO>FV</F350_ID_TIPO_DOCTO>
    <F350_CONSEC_DOCTO>191375</F350_CONSEC_DOCTO>
    <F320_ROWID>3</F320_ROWID>
    <F320_ID_SERVICIO>VS0217</F320_ID_SERVICIO>
    <F320_ID_MOTIVO>IT</F320_ID_MOTIVO>
    <F320_ID_CO_MOVTO>10</F320_ID_CO_MOVTO>
    <F320_ID_UN_MOVTO>10</F320_ID_UN_MOVTO>
    <F320_ID_CCOSTO_MOVTO>DO202008DD-015</F320_ID_CCOSTO_MOVTO>
    <F320_ID_TERCERO_MOVTO>830031687</F320_ID_TERCERO_MOVTO>
    <F320_ID_SUCURSAL_CLIENTE>001</F320_ID_SUCURSAL_CLIENTE>
    <F320_VLR_BRUTO>1003</F320_VLR_BRUTO>
  </Movimientos>

  <CuotasCxC>
    <F_CIA>1</F_CIA>
    <F350_ID_CO>10</F350_ID_CO>
    <F350_ID_TIPO_DOCTO>FV</F350_ID_TIPO_DOCTO>
    <F350_CONSEC_DOCTO>191375</F350_CONSEC_DOCTO>
    <F353_ID_TIPO_DOCTO_CRUCE>FV</F353_ID_TIPO_DOCTO_CRUCE>
    <F353_CONSEC_DOCTO_CRUCE>0</F353_CONSEC_DOCTO_CRUCE>
    <F353_FECHA_VCTO>20200826</F353_FECHA_VCTO>
    <F353_VLR__DSCTO_PP>0</F353_VLR__DSCTO_PP>
    <F353_FECHA_DSCTO_PP>20200826</F353_FECHA_DSCTO_PP>
  </CuotasCxC>
<Final>
  <F_CIA>1</F_CIA>
</Final></venta>]]></strFuenteDatos><Path>C:\inetpub\wwwroot\GTIntegration\Planos\</Path></ImportarDatosXML></soap:Body></soap:Envelope>